[
  {
    "comment": "I have a 70 yr old Gibson j45 and have issues from time to time as it gets well used. I recently had a fan brace that came undone under the top of the body. Very tricky fix. Jim repaired it perfect for me and I was back playing her in just a few days. Jim has replaced frets and, well anything that's needed, he does. He is a specialist when it comes to tune- ups. If your guitar is playing or sounding off, he's defiantly the guy who will bring it back to life. And his prices are from yesterday. If I could give 6 stars on his business I would!",
    "author": "Tony Koenen",
    "date": "2021-06-14",
    "location": "Kelowna, BC"
  },
  {
    "comment": "Jim did an excellent job installing a few parts on my stratocaster. He gives great advice, and he's a very friendly. I wouldn't go anywhere else to have my guitars looked at.",
    "author": "Matt P",
    "date": "2021-02-27",
    "location": "Kelowna, BC"
  },
  {
    "comment": "Passing on my dad's 1923 Leedy Tenor banjo to my daughter and wanted to get it checked out first. The banjo is 96 years old, hasn't been played since the 60's and has always been strung. Found JR Guitar Repair online, and with nothing but straight 5/5 ratings, knew Jim was the guy. Spot on estimate, excellent work and very reasonable price. My daughter and I are thrilled! Thanks again Jim!",
    "author": "Randy K.",
    "date": "2019-12-11",
    "location": "Castlegar, BC"
  },
  {
    "comment": "Wow, found Jim online didnt know what to expect.. My old guitar is like a new one. Very good work and great price.",
    "author": "Susane Paquet",
    "date": "2019-10-03",
    "location": "West Kelowna, BC"
  },
  {
    "comment": "I took my Mom's 75 year old Ukulele to Jim to have it restored and he did an amazing job ! It needed tuners, strings, fret work and repair of some cracks and it came back to life like new !! My Mom loved it ..over the moon ..and it was a wonderful surprise for her. She's 87 years old and bought the Uke when she was 12. It was very affordable and Jim was such a pleasure to deal with. Thank you Jim!",
    "author": "Candace Kaiser",
    "date": "2019-05-28",
    "location": "Kelowna, BC"
  },
  {
    "comment": "Heard of jim through a friend of mine. You won’t get better service any where else! Always friendly! Always willing to educate! And if you’re lucky he’ll let you pick up one of his strats lol. Jim does fantastic work, is a great musician and I’ll continue to bring my Axes to to JR",
    "author": "Dacoda Nevens",
    "date": "2018-11-16",
    "location": "Kelowna, BC"
  },
  {
    "comment": "Jim set up my new Seagull SG Burst ukulele for me, and it looks and feels and plays 100 times better than when I brought it to him. Great work, clear communication, wonderful outcome, and surprisingly affordable. I will be bringing my other ukes to Jim. I know he'll make a difference.",
    "author": "Cate",
    "date": "2018-11-22",
    "location": "Kelowna, BC"
  },
  {
    "comment": "Happen to find Jim while googling guitar setup in Kelowna. Read some reviews and decided to have him work on my lefty Strat. It's a tough guitar to get nice low action and he was able to get mine to where I've been wanting it for quite a while. Great job and very personable, I highly recommend his skill for your guitar setup!!",
    "author": "Brian",
    "date": "2018-01-29",
    "location": "West Kelowna, BC"
  },
  {
    "comment": "After moving to BC, found my 50 year old guitar had been 'compromised' during transit. Jim undertook a structural repair, which was well crafted and invisible. Jim went on to polish the frets and fretboard and hand carve a new bone bridge with a full set up. Work was done promptly, professionally and the guitar has never sounded this good. The set up greatly enhanced resonance and tone on all notes and chords. It's better than new. Impressive workmanship and knowledgable, and generous with time and effort. Excellent value for minimal cost. Thank you Jim.",
    "author": "John H.",
    "date": "2017-10-04",
    "location": "West Kelowna, BC"
  },
  {
    "comment": "Just Amazing!!!!! He help me make my squire jaguar bass be a rad fretless bass. Sound perfect and looks hot!!!!!! Thanks!!!!! PS he works accurate and fast!!!!",
    "author": "Alex Quintans",
    "date": "2016-03-04",
    "location": "Kelowna, BC (from Brazil)"
  },
  {
    "comment": "Jim set up 2 guitars for me - did a great job. Would highly recommend his work to everyone. Thanks, Jim!",
    "author": "Terry",
    "date": "2015-03-11",
    "location": "Lake Country, BC"
  },
  {
    "comment": "Jim helped me bring my vintage bass back to life. New strings, new frets, set-up with great intonation all the things that it takes to make instruments do what they are supposed to do. He did it fast and his rates were great. Call this man and let him do work for you!",
    "author": "Tom Kennedy",
    "date": "2015-03-01",
    "location": "Kelowna, BC"
  },
  {
    "comment": "I have a Gibson SG 61 re-issue. I always wanted this guitar but when I got it, i was very disappointed. I actually considered getting rid of it but thought I would take it to Jim first. Jim did a lot of fret work, made serious adjustments to neck, as well as all the standard action and intonation stuff. Guitar is amazing now! It plays the way I thought it should and I love it. Wow... a proper setup makes all the difference in the world! I would highly recommend him. Thanks Jim!",
    "author": "Peter Hopley",
    "date": "2015-02-28",
    "location": "Kelowna, BC"
  },
  {
    "comment": "Jim did great work fine tuning the set up on my Les Paul. Over a year ago the guitar had suffered a fall that resulted in one of the machine heads getting torn off. While I had repaired this myself with only a moderate degree of success, the instrument was super difficult to keep in tune and also had some intonation problems. Jim remedied all of that. The frets are like new, the intonation is spot on and the tuning is totally solid. He made the guitar a pleasure to play again. I recommend his work without reservation.",
    "author": "Robin Fairbridge",
    "date": "2015-01-30",
    "location": "Penticton, BC"
  },
  {
    "comment": "While visiting Kelowna, the neck on my Taylor developed a serious crack. Recently I broke my hand in a motorcycle accident. Besides the obvious reasons to want my guitar fixed ,it also is an important part of my physiotherapy. I found Jim's name online and took my guitar to him. When he found out my situation he immediately went to work on the guitar and repaired it beautifully. Despite being a busy time of year and me being a transient customer he went out of his way. I thanked him of course and tried to tell him how grateful I am. A talented man with a huge heart.",
    "author": "Jim DesJarlais",
    "date": "2014-12-15",
    "location": "Duncan, BC"
  },
  {
    "comment": "Jim is great at setting up guitars! He's helped so many including myself, in giving Cool options on electric guitars. Jim is a good guitarist which helps him Relate to singer/guitarists like myself as he understands the issues that occur with electrics. If you haven't got anyone to help you with your guitar... Call Jim and you'll be taken care of.",
    "author": "Jeremy Mesenger",
    "date": "2014-11-30",
    "location": "Kelowna, BC"
  },
  {
    "comment": "I have a variety of guitars and had them all set up by Jim. Most recently he worked on my 59 Les Paul Jr. He brought it to life and treated it like it was his own. I Jim appreciate his professionalism and pride he takes in his work. If you need guitar work this is the place! Thanks Jim.",
    "author": "Wayne Russell",
    "date": "2014-09-29",
    "location": "Kelowna, BC"
  },
  {
    "comment": "If you need repairs or fret work done Jim is the guy you need to see. He is passionate about guitars and provides very exacting workmanship. He strikes me as someone who isn’t happy until you are. I am extremely pleased with the work he did on my 40 year old Ovation Legend guitar as well as my Fender Stratocaster. I highly recommend him.",
    "author": "Keith Bieber",
    "date": "2014-06-18",
    "location": "Vernon, BC"
  },
  {
    "comment": "I just wanted to say I get all my guitars set up by Jim. I am a builder however even the best made guitars won't play well or even at all unless you have set them up properly. That's where Jim comes into the picture. I love to build guitars but set up I leave to him completely. He recieves fro me a fresh built guitar with the bridge attached and then the magic begins. When I get a guitar back it plays unbelievable. It sounds amazing and is taken care of so well. I can't say enough about Jim's workmen ship. He brings life to my guitars. Will be using Jim exclusively for all my builds.",
    "author": "Blake Dixon (Longwing guitars)",
    "date": "2014-02-09",
    "location": "Kelowna, BC"
  },
  {
    "comment": "Jim is a unique combination of guitar master, repair guru and great guy. His passion for the guitar shows through everything he does; I am loving the custom Tele he sold me last year. You can't go wrong with sending your babies to Jim. He'll take great care of them as he did with my Strat. Thanks brother!",
    "author": "Brian Burnham",
    "date": "2014-02-08",
    "location": "Kelowna, BC"
  },
  {
    "comment": "I've had Jim work on a few of my guitars over the years. Jim's work is exceptional, my accoustic was a pawn shop special that I dragged around the planet with me for 15 years it got to the point where it was almost unplayable. Jim internated straightened out the neck filed some frets and now it plays unreal. Everyone always comments on how well it plays. Jim also built a telecaster for me which I think is an anomaly because no matter how rough I am with that thing it always stays in tune. I will be going back to Jim to get a Bigsby attached. I have no hesitations recommending Jim's work to anyone interested in buying a guitar or getting one worked on.",
    "author": "Tim Allen",
    "date": "2014-02-07",
    "location": "Kelowna, BC"
  }
]
